Tekla Open API Reference for Tekla Structures 2025
ShapeItem.GetAllMetadataKeys Method
 Get the Shape item's metadata keys.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<string> GetAllMetadataKeys()
Public Function GetAllMetadataKeys As List(Of String)
Return Value
Type: List<String>
A list of strings containing the keys.
Examples
public void SetMetadataTest()
{
    var polymesh = CreateSomeValidBrep();
    var shapeItem = new ShapeItem
    {
        Name = "TestFileName",
        ShapeFacetedBrep = polymesh,
        UpAxis = ShapeUpAxis.Z_Axis
    };
    shapeItem.Insert();
    var keys = shapeItem.GetAllMetadataKeys();
}
See Also
Reference
ShapeItem Class
Tekla.Structures.Catalogs Namespace